{
  "chunk_id": "19cddac0-4199-4c00-9f2e-ba9916617b4a_0",
  "chunk_index": 0,
  "page_number": 2,
  "content": "Response to the Scope of Work 1.5.1 Authorizations (6-page limit) 1.5.1.1 Medicaid Enrollment Verida offers intuitive technology solutions as part of our Medicaid member enrollment verification process. These methods provide flexibility and minimize the administrative burden on members and medical providers by giving them the ability to process travel requests electronically. Telephone Our CSRs dedicated to the Montana NEMT program will accept reservations, via a toll-free number, Monday through Friday from 8:00 a.m. to 5:00 p.m. (Mountain time). After-hours and holiday calls will be answered by our back-up CSRs who will be available 24 hours a day, seven days a week. Speech/Hearing Impaired: Members with a speech or hearing impairment can contact Verida using our TTY/TTD lines or the Federal Communications Commission’s Telecommunications Relay Service (TRS) or 711. Web Portals Web Portal - Member: Members can reserve, modify, or cancel an advanced trip request online using our secure,",
  "metadata": {
    "source": "/var/folders/gz/k36gq2996sv7n9j0vz238yv40000gp/T/tmplrleg_rs.docx",
    "category_depth": 0,
    "file_directory": "/var/folders/gz/k36gq2996sv7n9j0vz238yv40000gp/T",
    "filename": "tmplrleg_rs.docx",
    "page_number": 2,
    "languages": [
      "eng"
    ],
    "filetype": "application/vnd.openxmlformats-officedocument.wordprocessingml.document",
    "parent_id": "820493cea755bc0bf5082e922b185955",
    "emphasized_text_contents": [
      "Figure",
      "Figure",
      "1.5.1.1-1",
      "1.5.1.1-1",
      ":",
      ":",
      "Avenues",
      "for",
      "members",
      "to",
      "submit",
      "reservation",
      "requests."
    ],
    "emphasized_text_tags": [
      "b",
      "i",
      "b",
      "i",
      "b",
      "i",
      "i",
      "i",
      "i",
      "i",
      "i",
      "i",
      "i"
    ],
    "text_as_html": "<table><tr><td>Telephone</td><td>Our CSRs dedicated to the Montana NEMT program will accept reservations, via a toll-free number, Monday through Friday from 8:00 a.m. to 5:00 p.m. (Mountain time). After-hours and holiday calls will be answered by our back-up CSRs who will be available 24 hours a day, seven days a week. Speech/Hearing Impaired: Members with a speech or hearing impairment can contact Verida using our TTY/TTD lines or the Federal Communications Commission’s Telecommunications Relay Service (TRS) or 711.</td></tr><tr><td>Web Portals</td><td>Web Portal - Member: Members can reserve, modify, or cancel an advanced trip request online using our secure, HIPAA compliant, and user-friendly member portal. The trip determination (approval or denial), pickup time, and other pertinent details are online.</td></tr><tr><td>Web Portals</td><td>Web Portal - Facilities: Our secure facilities web portal enables health care providers, case managers, or approved designees to submit a transportation request on behalf of a member. Upon receipt of a request, Verida reviews data and promptly informs the facility of the authorization determination.</td></tr><tr><td>Mobile App</td><td>Our free Member Mobile App for smartphones and tablets may be used to request, modify, or cancel a trip; request a return trip pick-up; and check the status of a transport. Trip details including approval or denial, pick-up time, and other pertinent details will be viewable on the app. The app enables the member to track the assigned driver and view the driver’s estimated time of arrival.</td></tr><tr><td>Fax</td><td>As a backup to all other preferred avenues, a well-monitored, dedicated fax line receives requests for NEMT services or exchange documentation. The requesting entity simply completes a trip request form and faxes it to our operations center.</td></tr><tr><td>Email</td><td>Encrypted email provides a secure and efficient way to communicate with facilities, agencies, or individuals when scheduling routine or specialized trips.</td></tr></table>",
    "page": 2,
    "total_pages": 77,
    "chunk_method": "smart_word_doc_processor",
    "char_count": 2329,
    "location": "Montana",
    "year": 2025,
    "doc_type": "response",
    "document_id": "19cddac0-4199-4c00-9f2e-ba9916617b4a",
    "document_name": "20251119_154106_Montana_Response_Draft.docx",
    "chunk_size": 1000,
    "chunk_overlap": 100,
    "chunk_id": "19cddac0-4199-4c00-9f2e-ba9916617b4a_0",
    "chunk_index": 0
  }
}